// Создать приложение, с помощью которого пользователь, введя целое число n и основание степени x узнает,
// существует ли целочисленный показатель степени y для которого выполняется равенство xy = n. В случае,
// если показатель существует – вычислить его и вывести. В противном случае вывести текст – «Целочисленный показатель не существует».
fun main(args: Array<String>) {
    print("Введите целое число n: ")
    val n = readln().toInt()
    print("Введите основание степени x: ")
    val x = readln().toInt(); var y = 0
    var result = 1
    while (result < n) {
        y++
        result *= x
    }
    if (result == n) {
        println("Целочисленный показатель y: $y")
    } else {
        println("Целочисленный показатель не существует")
    }
}